
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	 
	//Добавление группы "ГруппаСкидкаПересчет" перед элементом "Страницы"
	ЭлементСтраницы = Элементы.Найти("Страницы");	
	ЭлементСкидка = Элементы.Вставить("ГруппаСкидкаПересчет", Тип("ПолеФормы"),,ЭлементСтраницы);
		
	ГруппаСкидкаПересчет = Элементы.Добавить("ГруппаОбычная", Тип("ГруппаФормы"), ЭтотОбъект);
	ГруппаСкидкаПересчет.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСкидкаПересчет.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;  
	
	Элементы.Переместить(ГруппаСкидкаПересчет, ЭтотОбъект, ЭлементСтраницы); 
	
	//Добавление элемента "Согласованная скидка" в группу "ГруппаСкидкаПересчет"
	ЭлементСогасованнаяСкидка = Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), ГруппаСкидкаПересчет);
	ЭлементСогасованнаяСкидка.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементСогасованнаяСкидка.ПутьКДанным = "Объект.СогласованнаяСкидка";
	//При изменении согласованной скидки будет выполняться процедура "ПриИзмененииСкидки"
	ЭлементСогасованнаяСкидка.УстановитьДействие("ПриИзменении", "ПриИзмененииСкидки");
	//Добавляем программно команду для перерасчета документа с учетом согласованной скидки
	Команда = Команды.Добавить("ПоказатьПредупреждение");
	Команда.Заголовок = "Пересчитать с учетом скидки";
	Команда.Действие = "ПересчитатьСУчетомСкидки";
	//Добавляем команду на форму в виде кнопки	
	КнопкаФормы = Элементы.Добавить("КнопкаПоказатьПредупреждение", Тип("КнопкаФормы"), ГруппаСкидкаПересчет);
	КнопкаФормы.ИмяКоманды = "ПоказатьПредупреждение";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;  	
	
КонецПроцедуры
 
//Диалог с пользователем при изменении процента согласованной скидки
&НаКлиенте
Процедура ПриИзмененииСкидки(Элемент)
	
	//Проверяем есть ли данные в ТЧ Товары и Услуги
	ТекущиеДанныеТаблицыТовары = Элементы.Товары.ТекущиеДанные;
		
	ТекущиеДанныеТаблицыУслуги = Элементы.Услуги.ТекущиеДанные;
	
	Если ТекущиеДанныеТаблицыТовары = Неопределено И ТекущиеДанныеТаблицыУслуги = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//Если данные есть, спрашиваем пользователя о необходимости пересчета табличных частей
	Режим = РежимДиалогаВопрос.ДаНет; 
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаНаКлиенте", ЭтотОбъект, Параметры);  
	
	ПоказатьВопрос(Оповещение, "Изменен процент скидки. Выполнить пересчет товаров и услуг?", Режим); 
    
	
		
КонецПроцедуры  
//Проверяем ответ от пользователя
&НаКлиенте
Процедура ПослеЗакрытияВопросаНаКлиенте(Результат, Параметры) Экспорт
	//Пересчитываем табличные части, если пользователь ответил Да
	Если Результат = КодВозвратаДиалога.Да Тогда
			
		ПересчитатьСУчетомСкидки();
				
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
    
    
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Пересчитываем строки ТЧ товары и услуги и сумму документа с учетом скидки
&НаКлиенте
Процедура ПересчитатьСУчетомСкидки()
	
	Для Каждого Строка Из Объект.Товары Цикл 
		
		РассчитатьСуммуСтроки(Строка);
      		
	КонецЦикла;
	
	Для Каждого Строка Из Объект.Услуги Цикл 
		
		РассчитатьСуммуСтроки(Строка);
      		
	КонецЦикла; 
	
	РассчитатьСуммуДокумента();
 	
КонецПроцедуры      


&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	 
	//Расчитываем общую скидку
	ОбщаяСкидка = Объект.СогласованнаяСкидка + ТекущиеДанные.Скидка; 
	
	//Проверяем что скидка не превышает 100% и пересчитываем сумму строки
	Если ОбщаяСкидка < 100 Тогда
		КоэффициентСкидки = 1 - ОбщаяСкидка / 100; 
		ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки; 
	Иначе
		Сообщить(СтрШаблон("Общая скидка позиции %2 больше 100 процентов и составляет %1, что недопустимо!!!", ОбщаяСкидка, ТекущиеДанные.Номенклатура)); 
		ТекущиеДанные.Сумма = 0;
	КонецЕсли;
   

	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
