
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	 
	
	ЭлементСтраницы = Элементы.Найти("Страницы");	
	ЭлементСкидка = Элементы.Вставить("ГруппаСкидкаПересчет", Тип("ПолеФормы"),,ЭлементСтраницы);
		
	ГруппаСкидкаПересчет = Элементы.Добавить("ГруппаОбычная", Тип("ГруппаФормы"), ЭтаФорма);
	ГруппаСкидкаПересчет.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСкидкаПересчет.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;  
	
	Элементы.Переместить(ГруппаСкидкаПересчет, ЭтаФорма, ЭлементСтраницы); 
	
	ЭлементСогасованнаяСкидка = Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), ГруппаСкидкаПересчет);
	ЭлементСогасованнаяСкидка.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементСогасованнаяСкидка.ПутьКДанным = "Объект.СогласованнаяСкидка";
	ЭлементСогасованнаяСкидка.УстановитьДействие("ПриИзменении", "ПриИзмененииСкидки");
	
	Команда = Команды.Добавить("ПоказатьПредупреждение");
	Команда.Заголовок = "Пересчитать с учетом скидки";
	Команда.Действие = "ПересчитатьСУчетомСкидки";
		
	КнопкаФормы = Элементы.Добавить("КнопкаПоказатьПредупреждение", Тип("КнопкаФормы"), ГруппаСкидкаПересчет);
	КнопкаФормы.ИмяКоманды = "ПоказатьПредупреждение";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;  	
	
КонецПроцедуры

// ++ Иванов Е.А. 20.07.2026  

&НаКлиенте
Процедура ПриИзмененииСкидки(Элемент)
	

	ТекущиеДанныеТаблицыТовары = Элементы.Товары.ТекущиеДанные;
		
	ТекущиеДанныеТаблицыУслуги = Элементы.Услуги.ТекущиеДанные;
	Если ТекущиеДанныеТаблицыТовары = Неопределено И ТекущиеДанныеТаблицыУслуги = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Режим = РежимДиалогаВопрос.ДаНет; 
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаНаКлиенте", ЭтотОбъект, Параметры);  
	
	ПоказатьВопрос(Оповещение, "Изменен процент скидки. Выполнить пересчет товаров и услуг?", Режим); 
    
	
		
КонецПроцедуры  

&НаКлиенте
Процедура ПослеЗакрытияВопросаНаКлиенте(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		
		ПересчитатьСУчетомСкидки();
		
			
	КонецЕсли; 
	
		
КонецПроцедуры

// --


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
    
    
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ++ Иванов Е.А. 20.07.2026

&НаКлиенте
Процедура ПересчитатьСУчетомСкидки()
	
	Для Каждого Строка Из Объект.Товары Цикл 
		
		РассчитатьСуммуСтроки(Строка);
      		
	КонецЦикла;
	
	Для Каждого Строка Из Объект.Услуги Цикл 
		
		РассчитатьСуммуСтроки(Строка);
      		
	КонецЦикла; 
	
	РассчитатьСуммуДокумента();
 	
КонецПроцедуры      

// --

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	// ++ Иванов Е.А. 24.07.2026
	// Было:
	//КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	//ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	// Стало: 
	
	ОбщаяСкидка = Объект.СогласованнаяСкидка + ТекущиеДанные.Скидка; 
	
	Если ОбщаяСкидка < 100 Тогда
		КоэффициентСкидки = 1 - ОбщаяСкидка / 100; 
		ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки; 
	Иначе
		Сообщить(СтрШаблон("Общая скидка позиции %2 больше 100 процентов и составляет %1, что недопустимо!!!", ОбщаяСкидка, ТекущиеДанные.Номенклатура)); 
		ТекущиеДанные.Сумма = 0;
	КонецЕсли;

    // --    

	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
